app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    if @location.save
---
INSERT INTO "locations" ("title", "description", "address", "ip_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "cdcdcd"], ["description", "best buy"], ["address", "dcdcdc"], ["ip_address", "198.22.122.158"], ["created_at", 2017-03-29 20:33:58 UTC], ["updated_at", 2017-03-29 20:33:58 UTC]]

  def update
    if @location.update(location_params)
---
UPDATE "locations" SET "address" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "locations"."id" = $5  [["address", "rickmond, va"], ["latitude", 37.5407246], ["longitude", -77.4360481], ["updated_at", 2017-03-29 19:23:05 UTC], ["id", 6]]

  def destroy
    @location.destroy
---
DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 1]]